app/controllers/service_controller.rb

  def json
    url = params[:url]
    ret = "{}"
    if url.present?
      unless @page = Page.find_by_url(url)
---
SELECT * FROM `pages` WHERE (`pages`.`url` = 'http://incquity.com/articles/startup/9-tips-achieve-successful-business') LIMIT 1